app/Controllers/GetDataSiswaController.php

SELECT *
FROM `pendaftar`
LEFT JOIN `user` ON `user`.`id_user` = `pendaftar`.`id_user`
JOIN `jurusan` ON `pendaftar`.`id_jurusan` = `jurusan`.`id`
SELECT *
FROM `user`
JOIN `pendaftar` ON `user`.`id_user` = `pendaftar`.`id_user`
JOIN `jurusan` ON `pendaftar`.`id_jurusan` = `jurusan`.`id`
---
    public function GetData()
    {
        $model = new MSiswa();
        $query =  $model->table('pendaftar')
            ->join('user', 'user.id_user = pendaftar.id_user', 'LEFT')
            ->join('jurusan', 'pendaftar.id_jurusan = jurusan.id')
            ->find();